## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `aws_docdb_cluster.ai-answers-docdb-cluster`                                 |
|        | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]`                    |
|        | `aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group` |
|        | `aws_docdb_subnet_group.ai-answers-docdb-subnet-group`                       |
|        | `aws_security_group.ai-answers-docdb-sg`                                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m23:03:41.809[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m23:03:41.809[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m23:03:41.809[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_cluster.ai-answers-docdb-cluster will be created
[0;90m23:03:41.809[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_cluster" "ai-answers-docdb-cluster" {
[0;90m23:03:41.809[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + apply_immediately               = true
[0;90m23:03:41.809[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                             = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zones              = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + backup_retention_period         = 1
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_identifier              = "ai-answers-docdb-cluster"
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_identifier_prefix       = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_members                 = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_resource_id             = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + db_cluster_parameter_group_name = "ai-asnwers-docdb-cluster-parameter-group"
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + db_subnet_group_name            = "ai-answers-example-docdb-subnet-group"
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + endpoint                        = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine                          = "docdb"
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine_version                  = "5.0.0"
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + hosted_zone_id                  = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                              = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + kms_key_id                      = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + master_password                 = (sensitive value)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + master_username                 = (sensitive value)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + port                            = 27017
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_backup_window         = (known after apply)
[0;90m23:03:41.810[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_maintenance_window    = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + reader_endpoint                 = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_final_snapshot             = true
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + storage_encrypted               = true
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                            = {
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                        = {
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_security_group_ids          = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] will be created
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + apply_immediately               = true
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                             = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + auto_minor_version_upgrade      = true
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone               = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ca_cert_identifier              = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_identifier              = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + db_subnet_group_name            = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + dbi_resource_id                 = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + endpoint                        = (known after apply)
[0;90m23:03:41.811[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine                          = "docdb"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine_version                  = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                              = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + identifier                      = "ai-answers-docdb-instance"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + identifier_prefix               = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_class                  = "db.t3.medium"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + kms_key_id                      = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + performance_insights_kms_key_id = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + port                            = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_backup_window         = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_maintenance_window    = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + promotion_tier                  = 0
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + publicly_accessible             = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + storage_encrypted               = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                            = {
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                        = {
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + writer                          = (known after apply)
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group will be created
[0;90m23:03:41.812[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_cluster_parameter_group" "ai-answers-docdb-cluster-parameter-group" {
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn         = (known after apply)
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description = "Parameter group for DocumentDB"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + family      = "docdb5.0"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "ai-asnwers-docdb-cluster-parameter-group"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags        = {
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all    = {
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + parameter {
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + apply_method = "pending-reboot"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + name         = "tls"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + value        = "enabled"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group will be created
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn         = (known after apply)
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description = "Subnet group for DocumentDB for the AI Answers app"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "ai-answers-example-docdb-subnet-group"
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m23:03:41.813[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_ids  = [
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "subnet-0079deb64a44ba2ea",
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags        = {
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all    = {
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.ai-answers-docdb-sg will be created
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_security_group" "ai-answers-docdb-sg" {
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = "Security group for DocumentDB for the AI Answers app"
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress                 = [
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + cidr_blocks      = [
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + "10.0.0.0/16",
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + from_port        = 0
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + ipv6_cidr_blocks = []
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + prefix_list_ids  = []
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + protocol         = "-1"
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + security_groups  = []
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + self             = false
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + to_port          = 0
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (1 unchanged attribute hidden)
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m23:03:41.814[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress                = [
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + cidr_blocks      = [
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + "10.0.0.0/16",
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + from_port        = 27017
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + ipv6_cidr_blocks = []
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + prefix_list_ids  = []
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + protocol         = "tcp"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + security_groups  = []
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + self             = false
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + to_port          = 27017
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (1 unchanged attribute hidden)
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                   = "ai-answers-example-docdb-sg"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revoke_rules_on_delete = false
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "react-answers-staging"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = "vpc-0b3b4d18b4a4a0f63"
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 5 to add, 0 to change, 0 to destroy.
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m23:03:41.815[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + aws_docdb_cluster_arn = (known after apply)
[0;90m23:03:41.816[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + aws_docdb_cluster_id  = (known after apply)
[0;90m23:03:41.816[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m23:03:41.816[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m23:03:41.816[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m23:03:41.816[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
